app/controllers/produtos_controller.rb

SELECT  "produtos".* FROM "produtos"  ORDER BY "produtos"."nome" ASC LIMIT 2
SELECT  "produtos".* FROM "produtos"  ORDER BY "produtos"."preco" ASC LIMIT 2
---
    def index
        @produtos_nome = Produto.order(:nome).limit 20
        @produtos_preco = Produto.order(:preco).limit 3

INSERT INTO "produtos" ("nome", "descricao", "preco", "quantidade", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Calca preta"], ["descricao", "Calca comum da cor preta"], ["preco", 67.0], ["quantidade", 54], ["created_at", "2018-03-21 16:01:31.097249"], ["updated_at", "2018-03-21 16:01:31.097249"]]
---
    def create
        valores = params.require(:produto).permit :nome,:descricao,:preco,:quantidade
        @produto = Produto.new valores
        if @produto.save

DELETE FROM "produtos" WHERE "produtos"."id" = ?  [["id", 2]]
---
    def destroy
        id = params[:id]
        Produto.destroy id

SELECT "produtos".* FROM "produtos" WHERE (nome like '%Blusa%')
---
    def busca
        @nome_a_buscar = params[:nome]
        @produtos = Produto.where "nome like ?", "%#{@nome_a_buscar}%"

SELECT  "produtos".* FROM "produtos" WHERE "produtos"."id" = ? LIMIT 1  [["id", 9]]
---
    def edit
        id = params[:id]
        @produto = Produto.find(id)